In [3]:
import numpy as np   # It might be needed so,I import it.

In [4]:
import pandas as pd

## Pandas dataframe and indexing

In [5]:
name=pd.Series([6,7,8,9],index=['akash','nishad','tuba','kapil'])   # This is called data frame or uni-dimensional tabula column
name

akash     6
nishad    7
tuba      8
kapil     9
dtype: int64

In [6]:
name['tuba']   # Retrieving the assigned number

8

In [7]:
name['kapil']

9

In [8]:
name['akash']

6

In [9]:
name['nishad']

7

In [10]:
name2=pd.Series([10,11,12,13,14,15],index=['akash','nishad','tuba','kapil','jigar','saurabh'])
name2

akash      10
nishad     11
tuba       12
kapil      13
jigar      14
saurabh    15
dtype: int64

In [11]:
name+name2

akash      16.0
jigar       NaN
kapil      22.0
nishad     18.0
saurabh     NaN
tuba       20.0
dtype: float64

In [12]:
Akash_dataframe=pd.DataFrame(np.random.rand(6,4),index='Akash Nishad Kapil Jigar Tuba Saurabh'.split(),columns='Maths Science Social_Science English '.split())
Akash_dataframe          # Creating multi-dimensional tabula column 
              # if you don't want to write split then add comma.

            Maths   Science  Social_Science   English
Akash    0.272334  0.485308        0.672836  0.024442
Nishad   0.762387  0.310521        0.404577  0.628556
Kapil    0.618160  0.749763        0.053888  0.524947
Jigar    0.071877  0.421123        0.832749  0.643583
Tuba     0.107705  0.580278        0.079063  0.954430
Saurabh  0.104675  0.449891        0.137850  0.762016

In [13]:
Akash_dataframe['Science']   # calling Science column

Akash      0.485308
Nishad     0.310521
Kapil      0.749763
Jigar      0.421123
Tuba       0.580278
Saurabh    0.449891
Name: Science, dtype: float64

In [14]:
Akash_dataframe['Maths']

Akash      0.272334
Nishad     0.762387
Kapil      0.618160
Jigar      0.071877
Tuba       0.107705
Saurabh    0.104675
Name: Maths, dtype: float64

In [15]:
Akash_dataframe['Social_Science']

Akash      0.672836
Nishad     0.404577
Kapil      0.053888
Jigar      0.832749
Tuba       0.079063
Saurabh    0.137850
Name: Social_Science, dtype: float64

In [16]:
Akash_dataframe['English']

Akash      0.024442
Nishad     0.628556
Kapil      0.524947
Jigar      0.643583
Tuba       0.954430
Saurabh    0.762016
Name: English, dtype: float64

In [17]:
Akash_dataframe[['Science','English']]

          Science   English
Akash    0.485308  0.024442
Nishad   0.310521  0.628556
Kapil    0.749763  0.524947
Jigar    0.421123  0.643583
Tuba     0.580278  0.954430
Saurabh  0.449891  0.762016

In [18]:
Akash_dataframe[['Maths','English']]

            Maths   English
Akash    0.272334  0.024442
Nishad   0.762387  0.628556
Kapil    0.618160  0.524947
Jigar    0.071877  0.643583
Tuba     0.107705  0.954430
Saurabh  0.104675  0.762016

In [19]:
Akash_dataframe[['Science','Social_Science']]

          Science  Social_Science
Akash    0.485308        0.672836
Nishad   0.310521        0.404577
Kapil    0.749763        0.053888
Jigar    0.421123        0.832749
Tuba     0.580278        0.079063
Saurabh  0.449891        0.137850

In [20]:
Akash_dataframe[['Maths','English']]

            Maths   English
Akash    0.272334  0.024442
Nishad   0.762387  0.628556
Kapil    0.618160  0.524947
Jigar    0.071877  0.643583
Tuba     0.107705  0.954430
Saurabh  0.104675  0.762016

In [21]:
Akash_dataframe[['Social_Science','Maths']]

         Social_Science     Maths
Akash          0.672836  0.272334
Nishad         0.404577  0.762387
Kapil          0.053888  0.618160
Jigar          0.832749  0.071877
Tuba           0.079063  0.107705
Saurabh        0.137850  0.104675

In [22]:
Akash_dataframe[['Science','Maths','English']]   # Calling Science Maths and English

          Science     Maths   English
Akash    0.485308  0.272334  0.024442
Nishad   0.310521  0.762387  0.628556
Kapil    0.749763  0.618160  0.524947
Jigar    0.421123  0.071877  0.643583
Tuba     0.580278  0.107705  0.954430
Saurabh  0.449891  0.104675  0.762016

In [23]:
Akash_dataframe['Gujarati']=Akash_dataframe['Science']+Akash_dataframe['Social_Science']  # Adding gujarati column
Akash_dataframe

            Maths   Science  Social_Science   English  Gujarati
Akash    0.272334  0.485308        0.672836  0.024442  1.158144
Nishad   0.762387  0.310521        0.404577  0.628556  0.715098
Kapil    0.618160  0.749763        0.053888  0.524947  0.803651
Jigar    0.071877  0.421123        0.832749  0.643583  1.253872
Tuba     0.107705  0.580278        0.079063  0.954430  0.659341
Saurabh  0.104675  0.449891        0.137850  0.762016  0.587741

In [24]:
Akash_dataframe['Hindi']=Akash_dataframe['Maths']+Akash_dataframe['English']  # Adding gujarati column
Akash_dataframe

            Maths   Science  Social_Science   English  Gujarati     Hindi
Akash    0.272334  0.485308        0.672836  0.024442  1.158144  0.296776
Nishad   0.762387  0.310521        0.404577  0.628556  0.715098  1.390943
Kapil    0.618160  0.749763        0.053888  0.524947  0.803651  1.143107
Jigar    0.071877  0.421123        0.832749  0.643583  1.253872  0.715460
Tuba     0.107705  0.580278        0.079063  0.954430  0.659341  1.062135
Saurabh  0.104675  0.449891        0.137850  0.762016  0.587741  0.866691

In [25]:
Akash_dataframe['Thermodynamics']=Akash_dataframe['Hindi']+Akash_dataframe['Gujarati']  # Adding gujarati column
Akash_dataframe

,Maths,Science,Social_Science,English,Gujarati,Hindi,Thermodynamics
Akash,0.272334,0.485308,0.672836,0.024442,1.158144,0.296776,1.454920
Nishad,0.762387,0.310521,0.404577,0.628556,0.715098,1.390943,2.106040
Kapil,0.618160,0.749763,0.053888,0.524947,0.803651,1.143107,1.946758
Jigar,0.071877,0.421123,0.832749,0.643583,1.253872,0.715460,1.969332
Tuba,0.107705,0.580278,0.079063,0.954430,0.659341,1.062135,1.721476
Saurabh,0.104675,0.449891,0.137850,0.762016,0.587741,0.866691,1.454433

In [26]:
Akash_dataframe.drop('Science',axis=1)  # axis=0 is for rows and axis=1 is for column

,Maths,Social_Science,English,Gujarati,Hindi,Thermodynamics
Akash,0.272334,0.672836,0.024442,1.158144,0.296776,1.454920
Nishad,0.762387,0.404577,0.628556,0.715098,1.390943,2.106040
Kapil,0.618160,0.053888,0.524947,0.803651,1.143107,1.946758
Jigar,0.071877,0.832749,0.643583,1.253872,0.715460,1.969332
Tuba,0.107705,0.079063,0.954430,0.659341,1.062135,1.721476
Saurabh,0.104675,0.137850,0.762016,0.587741,0.866691,1.454433

In [27]:
Akash_dataframe.drop("Akash")   # If we dont specify axis the it will automatically consider axis=0 by default

,Maths,Science,Social_Science,English,Gujarati,Hindi,Thermodynamics
Nishad,0.762387,0.310521,0.404577,0.628556,0.715098,1.390943,2.106040
Kapil,0.618160,0.749763,0.053888,0.524947,0.803651,1.143107,1.946758
Jigar,0.071877,0.421123,0.832749,0.643583,1.253872,0.715460,1.969332
Tuba,0.107705,0.580278,0.079063,0.954430,0.659341,1.062135,1.721476
Saurabh,0.104675,0.449891,0.137850,0.762016,0.587741,0.866691,1.454433

In [28]:
Akash_dataframe.drop(["Maths","Science"],axis=1)

         Social_Science   English  Gujarati     Hindi  Thermodynamics
Akash          0.672836  0.024442  1.158144  0.296776        1.454920
Nishad         0.404577  0.628556  0.715098  1.390943        2.106040
Kapil          0.053888  0.524947  0.803651  1.143107        1.946758
Jigar          0.832749  0.643583  1.253872  0.715460        1.969332
Tuba           0.079063  0.954430  0.659341  1.062135        1.721476
Saurabh        0.137850  0.762016  0.587741  0.866691        1.454433

In [29]:
Akash_dataframe1={'ID':[121,432,231,156,298],'Name':['Akash','Jyoti','Nishad','Kapil','Tuba'],'Profit':[245,214,785,342,654]} # Dictionary
New=pd.DataFrame(Akash_dataframe1)
New

    ID    Name  Profit
0  121   Akash     245
1  432   Jyoti     214
2  231  Nishad     785
3  156   Kapil     342
4  298    Tuba     654

In [30]:
New.drop('ID',axis=1)

     Name  Profit
0   Akash     245
1   Jyoti     214
2  Nishad     785
3   Kapil     342
4    Tuba     654

In [31]:
New.drop('Name',axis=1)

    ID  Profit
0  121     245
1  432     214
2  231     785
3  156     342
4  298     654

In [32]:
New.drop('Profit',axis=1)

    ID    Name
0  121   Akash
1  432   Jyoti
2  231  Nishad
3  156   Kapil
4  298    Tuba

In [33]:
New.drop(3)

    ID    Name  Profit
0  121   Akash     245
1  432   Jyoti     214
2  231  Nishad     785
4  298    Tuba     654

In [34]:
New.drop(0)

    ID    Name  Profit
1  432   Jyoti     214
2  231  Nishad     785
3  156   Kapil     342
4  298    Tuba     654

In [35]:
New.drop(4)

    ID    Name  Profit
0  121   Akash     245
1  432   Jyoti     214
2  231  Nishad     785
3  156   Kapil     342

In [36]:
New['Name']

0     Akash
1     Jyoti
2    Nishad
3     Kapil
4      Tuba
Name: Name, dtype: object

In [37]:
New['ID']

0    121
1    432
2    231
3    156
4    298
Name: ID, dtype: int64

In [38]:
New['Profit']

0    245
1    214
2    785
3    342
4    654
Name: Profit, dtype: int64

In [39]:
New[['Name','ID']]

     Name   ID
0   Akash  121
1   Jyoti  432
2  Nishad  231
3   Kapil  156
4    Tuba  298

In [40]:
New[['Name','Profit']]

     Name  Profit
0   Akash     245
1   Jyoti     214
2  Nishad     785
3   Kapil     342
4    Tuba     654

In [41]:
New[['Profit','ID']]

   Profit   ID
0     245  121
1     214  432
2     785  231
3     342  156
4     654  298